Revit 2020 API
FormatOptions.CanHaveUnitSymbol Method
 Checks whether a unit symbol can be specified for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public bool CanHaveUnitSymbol()
Visual Basic
Public Function CanHaveUnitSymbol As Boolean
Visual C++
public:
bool CanHaveUnitSymbol()
Return Value
 True if a unit symbol can be specified, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
CanHaveUnitSymbol Overload
Autodesk.Revit.DB Namespace